[
  {
    "title": "Assignment 1",
    "image": "assignment1.jpg",
    "description": "Complete the first assignment in the course. This assignment covers various topics from the course material and includes both theoretical questions and practical exercises. Make sure to submit your work by the deadline. Good luck!",
    "marks": 100,
    "difficulty": "easy",
    "date": "2023-11-10",
    "name": "Shakil",
    "email": "shakil@gmail.com"
  },
  {
    "title": "Math Homework",
    "image": "https://i.ibb.co/Pm5JcWY/math-homework.jpg",
    "description": "Solve the math problems for this week's homework. The problems include algebra, geometry, and calculus questions. You have one week to complete the assignment, so manage your time effectively. Remember to show all your work for full credit.",
    "marks": 50,
    "difficulty": "medium",
    "date": "2023-11-15",
    "name": "Shakil",
    "email": "shakil@gmail.com"
  },
  {
    "title": "History Essay",
    "image": "https://i.ibb.co/Qv6ZJjq/80756.jpg",
    "description": "Write an essay on a historical topic of your choice. Your essay should be well-researched and properly cited. You have the creative freedom to explore any era or event in history. This assignment is designed to encourage critical thinking and historical analysis.",
    "marks": 75,
    "difficulty": "medium",
    "date": "2023-11-20",
    "name": "Shakil",
    "email": "shakil@gmail.com"
  },
  {
    "title": "Science Project",
    "image": "science_project.png",
    "description": "Work on a group science project about ecosystems. You'll be conducting fieldwork to study local ecosystems, collect data, and present your findings in a final report. This project is a collaborative effort and will require effective communication and teamwork.",
    "marks": 90,
    "difficulty": "hard",
    "date": "2023-11-25",
    "name": "Arif",
    "email": "arif@gmail.com"
  },
  {
    "title": "Programming Assignment",
    "image": "programming_assignment.png",
    "description": "Write a program to solve a specific problem. You will be working with a programming language of your choice, and your code should be well-documented and efficient. This assignment tests your coding skills and problem-solving abilities.",
    "marks": 80,
    "difficulty": "easy",
    "date": "2023-12-01",
    "name": "Arif",
    "email": "arif@gmail.com"
  },
  {
    "title": "Literature Analysis",
    "image": "literature_analysis.jpg",
    "description": "Analyze a piece of literature and write a report. You can choose a novel, poem, or short story to analyze. Your report should include a detailed analysis of themes, characters, and literary devices used in the selected work.",
    "marks": 70,
    "difficulty": "easy",
    "date": "2023-12-05",
    "name": "Arif",
    "email": "arif@gmail.com"
  },
  {
    "title": "Physics Quiz",
    "image": "physics_quiz.png",
    "description": "Take an online quiz on physics concepts. The quiz will cover topics such as mechanics, electromagnetism, and thermodynamics. You have a limited time to complete the quiz, so be prepared.",
    "marks": 40,
    "difficulty": "hard",
    "date": "2023-12-10",
    "name": "Shahid",
    "email": "shahid@gmail.com"
  },
  {
    "title": "Art Project",
    "image": "https://i.ibb.co/zZP504X/29174328-artist-1.jpg",
    "description": "Create an art project based on a specific theme. You can choose your preferred medium, such as painting, sculpture, or digital art. This project allows you to express your creativity and artistic abilities.",
    "marks": 85,
    "difficulty": "medium",
    "name": "Shahid",
    "email": "shahid@gmail.com"
  },
  {
    "title": "Chemistry Experiment",
    "image": "chemistry_experiment.png",
    "description": "Conduct a chemistry experiment and document the results. You will be working in a controlled laboratory environment, following safety protocols. The experiment focuses on chemical reactions and their outcomes.",
    "marks": 60,
    "difficulty": "easy",
    "name": "Shahid",
    "email": "shahid@gmail.com"
  },
  {
    "title": "Geography Assignment",
    "image": "geography_assignment.jpg",
    "description": "Complete a geography assignment on world capitals. You will be researching and providing information on the capitals of various countries around the world. This assignment helps improve your geographical knowledge.",
    "marks": 55,
    "difficulty": "hard",
    "date": "2023-12-25",
    "name": "Shahid",
    "email": "shahid@gmail.com"
  }
]
